Autodesk.Revit.DB.Architecture.BalusterPattern.ExcessLengthFillBalusterId
The id of a Baluster family used to fill excess length, which is the extra space
along the railing segment that cannot be filled with a pattern.
If set to InvalidElementId, it will be the default - the id of the BaseRailingAttr containing the Baluster pattern.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Invalid ElementId for leftoverFill of BalusterPattern
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019